Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem.GetPipeFittingAndAccessoryData
Gets the fitting data stored in the UI data item.
Returns:
The fitting data stored in the UI data item.
Since:
2014

Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem.SetEntity(Autodesk.Revit.DB.ExtensibleStorage.Entity)
Stores the entity in the UI data item.
entity:
The Entity to be stored.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Writing of Entities of this Schema is not allowed to the current add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem.GetEntity
Returns the entity set by UI server.
or an invalid entity otherwise.
Remarks:
The Entity that is returned is a copy of the stored data (with copy-on-write optimization).
Modifying it is allowed (even with restricted write), but to save your changes you must call SetEntity.
Returns:
The returned Entity.
Since:
2014

Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem
The input and output data used by external UI servers for initializing and storing the UI settings.
Remarks:
One family instance has one UI data item.
The UI data item contains a corresponding PipeFittingAndAccessoryData which is used for initialing the UI settings and an entity which is used for storing the UI settings.
Since:
2014